[
    {
        "id": 1,
        "name": "Acid Splash",
        "school": "Evocation",
        "spell_lists": [
            "Sorcerer",
            "Wizard"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "60 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You create an acidic bubble at a point within range, where it explodes in a 5-foot-radius Sphere. Each creature in that Sphere must succeed on a Dexterity saving throw or take 1d6 Acid damage."
            },
            {
                "type": "body",
                "label": "Cantrip Upgrade",
                "text": "The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
            }
        ],
        "previous_spell": 17,
        "next_spell": 9,
        "special": []
    },
    {
        "id": 2,
        "name": "Blade Ward",
        "school": "Abjuration",
        "spell_lists": [
            "Bard",
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "Self",
        "components": [
            "V",
            "S"
        ],
        "duration": "Concentration, up to 1 minute",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Whenever a creature makes an attack roll against you before the spell ends, the attacker subtracts 1d4 from the attack roll."
            }
        ],
        "previous_spell": 1,
        "next_spell": 3,
        "special": [
            "C"
        ]
    },
    {
        "id": 3,
        "name": "Chill Touch",
        "school": "Necromancy",
        "spell_lists": [
            "Sorcerer",
            "Warlock",
            "Wizard"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "Touch",
        "components": [
            "V",
            "S"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Channeling the chill of the grave, make a melee spell attack against a target within reach. On a hit, the target takes 1d10 Necrotic damage, and it can’t regain Hit Points until the end of your next turn."
            },
            {
                "type": "body",
                "label": "Cantrip Upgrade",
                "text": "The damage increases by 1d10 when you reach levels 5 (2d10), 11 (3d10), and 17 (4d10)."
            }
        ],
        "previous_spell": 2,
        "next_spell": 4,
        "special": []
    },
    {
        "id": 4,
        "name": "Dancing Lights",
        "school": "Illusion",
        "spell_lists": [
            "Bard",
            "Sorcerer",
            "Wizard"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "120 feet",
        "components": [
            "V",
            "S",
            "M (a bit of phosphorus)"
        ],
        "duration": "Concentration, up to 1 minute",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You create up to four torch-size lights within range, making them appear as torches, lanterns, or glowing orbs that hover for the duration. Alternatively, you combine the four lights into one glowing Medium form that is vaguely humanlike. Whichever form you choose, each light sheds Dim Light in a 10-foot radius."
            },
            {
                "type": "body",
                "text": "As a Bonus Action, you can move the lights up to 60 feet to a space within range. A light must be within 20 feet of another light created by this spell, and a light vanishes if it exceeds the spell’s range."
            }
        ],
        "previous_spell": 3,
        "next_spell": 5,
        "special": [
            "C"
        ]
    },
    {
        "id": 5,
        "name": "Druidcraft",
        "school": "Transmutation",
        "spell_lists": [
            "Druid"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "30 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Whispering to the spirits of nature, you create one of the following effects within range."
            },
            {
                "type": "body",
                "label": "Weather Sensor",
                "text": "You create a Tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round."
            },
            {
                "type": "body",
                "label": "Bloom",
                "text": "You instantly make a flower blossom, a seed pod open, or a leaf bud bloom."
            },
            {
                "type": "body",
                "label": "Sensory Effect",
                "text": "You create a harmless sensory effect, such as falling leaves, spectral dancing fairies, a gentle breeze, the sound of an animal, or the faint odor of skunk. The effect must fit in a 5-foot Cube."
            },
            {
                "type": "body",
                "label": "Fire Play",
                "text": "You light or snuff out a candle, a torch, or a campfire."
            }
        ],
        "previous_spell": 4,
        "next_spell": 6,
        "special": []
    },
    {
        "id": 6,
        "name": "Eldritch Blast",
        "school": "Evocation",
        "spell_lists": [
            "Warlock"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "120 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You hurl a beam of crackling energy. Make a ranged spell attack against one creature or object in range. On a hit, the target takes 1d10 Force damage."
            },
            {
                "type": "body",
                "label": "Cantrip Upgrade",
                "text": "The spell creates two beams at level 5, three beams at level 11, and four beams at level 17. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam."
            }
        ],
        "previous_spell": 5,
        "next_spell": 7,
        "special": []
    },
    {
        "id": 7,
        "name": "Elementalism",
        "school": "Transmutation",
        "spell_lists": [
            "Druid",
            "Sorcerer",
            "Wizard"
        ],
        "level": 0,
        "casting_time": "Action",
        "range": "30 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You exert control over the elements, creating one of the following effects within range."
            },
            {
                "type": "body",
                "label": "Beckon Air",
                "text": "You create a breeze strong enough to ripple cloth, stir dust, rustle leaves, and close open doors and shutters, all in a 5-foot Cube. Doors and shutters being held open by someone or something aren’t affected."
            },
            {
                "type": "body",
                "label": "Beckon Earth",
                "text": "You create a thin shroud of dust or sand that covers surfaces in a 5-foot-square area, or you cause a single word to appear in your handwriting in a patch of dirt or sand."
            },
            {
                "type": "body",
                "label": "Beckon Fire",
                "text": "You create a thin cloud of harmless embers and colored, scented smoke in a 5-foot Cube. You choose the color and scent, and the embers can light candles, torches, or lamps in that area. The smoke’s scent lingers for 1 minute."
            },
            {
                "type": "body",
                "label": "Beckon Water",
                "text": "You create a spray of cool mist that lightly dampens creatures and objects in a 5-foot Cube. Alternatively, you create 1 cup of clean water either in an open container or on a surface, and the water evaporates in 1 minute."
            },
            {
                "type": "body",
                "label": "Sculpt Element",
                "text": "You cause dirt, sand, fire, smoke, mist, or water that can fit in a 1-foot Cube to assume a crude shape (such as that of a creature) for 1 hour."
            }
        ],
        "previous_spell": 6,
        "next_spell": 8,
        "special": []
    },
    {
        "id": 8,
        "name": "Reincarnate",
        "school": "Necromancy",
        "spell_lists": [
            "Druid"
        ],
        "level": 5,
        "casting_time": "1 hour",
        "range": "Touch",
        "components": [
            "V",
            "S",
            "M (rare oils worth 1,000+ GP, which the spell consumes)"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You touch a dead Humanoid or a piece of one. If the creature has been dead no longer than 10 days, the spell forms a new body for it and calls the soul to enter that body. Roll 1d10 and consult the table below to determine the body’s species, or the DM chooses another playable species."
            },
            {
                "type": "table",
                "table": [
                    {
                        "rows": [
                            "1d10",
                            "1",
                            "2",
                            "3",
                            "4",
                            "5"
                        ],
                        "alignment": "center",
                        "weight": 0.4
                    },
                    {
                        "rows": [
                            "Species",
                            "Aasimar",
                            "Dragonborn",
                            "Dwarf",
                            "Elf",
                            "Gnome"
                        ],
                        "alignment": "start",
                        "weight": 1
                    },
                    {
                        "rows": [
                            "1d10",
                            "6",
                            "7",
                            "8",
                            "9",
                            "10"
                        ],
                        "alignment": "center",
                        "weight": 0.4
                    },
                    {
                        "rows": [
                            "Species",
                            "Goliath",
                            "Halfling",
                            "Human",
                            "Orc",
                            "Tiefling"
                        ],
                        "alignment": "start",
                        "weight": 1
                    }
                ]
            },
            {
                "type": "body",
                "text": "The reincarnated creature makes any choices that a species’ description offers, and the creature recalls its former life. It retains the capabilities it had in its original form, except it loses the traits of its previous species and gains the traits of its new one."
            }
        ],
        "previous_spell": 0,
        "next_spell": 0,
        "special": [
            "M"
        ]
    },
    {
        "id": 9,
        "name": "Aid",
        "school": "Abjuration",
        "spell_lists": [
            "Bard",
            "Cleric",
            "Druid",
            "Paladin",
            "Ranger"
        ],
        "level": 2,
        "casting_time": "Action",
        "range": "30 feet",
        "components": [
            "V",
            "S",
            "M (a strip of white cloth)"
        ],
        "duration": "8 hours",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Choose up to three creatures within range. Each target’s Hit Point maximum and current Hit Points increase by 5 for the duration."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "Each target’s Hit Points increase by 5 for each spell slot level above 2."
            }
        ],
        "previous_spell": 1,
        "next_spell": 10,
        "special": []
    },
    {
        "id": 10,
        "name": "Alarm",
        "school": "Abjuration",
        "spell_lists": [
            "Ranger",
            "Wizard"
        ],
        "level": 1,
        "casting_time": "1 minute or Ritual",
        "range": "30 feet",
        "components": [
            "V",
            "S",
            "M (a bell and silver wire)"
        ],
        "duration": "8 hours",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You set an alarm against intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot Cube. Until the spell ends, an alarm alerts you whenever a creature touches or enters the warded area. When you cast the spell, you can designate creatures that won’t set off the alarm. You also choose whether the alarm is audible or mental:"
            },
            {
                "type": "body",
                "label": "Audible Alarm",
                "text": "The alarm produces the sound of a handbell for 10 seconds within 60 feet of the warded area."
            },
            {
                "type": "body",
                "label": "Mental Alarm",
                "text": "You are alerted by a mental ping if you are within 1 mile of the warded area. This ping awakens you if you’re asleep."
            }
        ],
        "previous_spell": 9,
        "next_spell": 11,
        "special": [
            "R"
        ]
    },
    {
        "id": 11,
        "name": "Alter Self",
        "school": "Transmutation",
        "spell_lists": [
            "Sorcerer",
            "Wizard"
        ],
        "level": 2,
        "casting_time": "Action",
        "range": "Self",
        "components": [
            "V",
            "S"
        ],
        "duration": "Concentration, up to 1 hour",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "You alter your physical form. Choose one of the following options. Its effects last for the duration, during which you can take a Magic action to replace the option you chose with a different one."
            },
            {
                "type": "body",
                "label": "Aquatic Adaptation",
                "text": "You sprout gills and grow webs between your fingers. You can breathe underwater and gain a Swim Speed equal to your Speed."
            },
            {
                "type": "body",
                "label": "Change Appearance",
                "text": "You alter your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and other distinguishing characteristics. You can make yourself appear as a member of another species, though none of your statistics change. You can’t appear as a creature of a different size, and your basic shape stays the same; if you’re bipedal, you can’t use this spell to become quadrupedal, for instance. For the duration, you can take a Magic action to change your appearance in this way again."
            },
            {
                "type": "body",
                "label": "Natural Weapons",
                "text": "You grow claws (Slashing), fangs (Piercing), horns (Piercing), or hooves (Bludgeoning). When you use your Unarmed Strike to deal damage with that new growth, it deals 1d6 damage of the type in parentheses instead of dealing the normal damage for your Unarmed Strike, and you use your spellcasting ability modifier for the attack and damage rolls rather than using Strength."
            }
        ],
        "previous_spell": 10,
        "next_spell": 12,
        "special": [
            "C"
        ]
    },
    {
        "id": 12,
        "name": "Animal Friendship",
        "school": "Enchantment",
        "spell_lists": [
            "Bard",
            "Druid",
            "Ranger"
        ],
        "level": 1,
        "casting_time": "Action",
        "range": "30 feet",
        "components": [
            "V",
            "S",
            "M (a morsel of food)"
        ],
        "duration": "24 hours",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Target a Beast that you can see within range. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. If you or one of your allies deals damage to the target, the spells ends."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "You can target one additional Beast for each spell slot level above 1."
            }
        ],
        "previous_spell": 11,
        "next_spell": 13,
        "special": []
    },
    {
        "id": 13,
        "name": "Animal Messenger",
        "school": "Enchantment",
        "spell_lists": [
            "Bard",
            "Druid",
            "Ranger"
        ],
        "level": 2,
        "casting_time": "Action or Ritual",
        "range": "30 feet",
        "components": [
            "V",
            "S",
            "M (a morsel of food)"
        ],
        "duration": "24 hours",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "A Tiny Beast of your choice that you can see within range must succeed on a Charisma saving throw, or it attempts to deliver a message for you (if the target’s Challenge Rating isn’t 0, it automatically succeeds). You specify a location you have visited and a recipient who matches a general description, such as “a person dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also communicate a message of up to twenty-five words. The Beast travels for the duration toward the specified location, covering about 25 miles per 24 hours or 50 miles if the Beast can fly."
            },
            {
                "type": "body",
                "text": "When the Beast arrives, it delivers your message to the creature that you described, mimicking your communication. If the Beast doesn’t reach its destination before the spell ends, the message is lost, and the Beast returns to where you cast the spell."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "The spell’s duration increases by 48 hours for each spell slot level above 2."
            }
        ],
        "previous_spell": 12,
        "next_spell": 14,
        "special": [
            "R"
        ]
    },
    {
        "id": 14,
        "name": "Animal Shapes",
        "school": "Transmutation",
        "spell_lists": [
            "Druid"
        ],
        "level": 8,
        "casting_time": "Action",
        "range": "30 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "24 hours",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Choose any number of willing creatures that you can see within range. Each target shape-shifts into a Large or smaller Beast of your choice that has a Challenge Rating of 4 or lower. You can choose a different form for each target. On later turns, you can take a Magic action to transform the targets again."
            },
            {
                "type": "body",
                "text": "A target’s game statistics are replaced by the chosen Beast’s statistics, but the target retains its creature type; Hit Points; Hit Point Dice; alignment; ability to communicate; and Intelligence, Wisdom, and Charisma scores. The target’s actions are limited by the Beast form’s anatomy, and it can’t cast spells. The target’s equipment melds into the new form, and the target can’t use any of that equipment while in that form."
            },
            {
                "type": "body",
                "text": "The target gains a number of Temporary Hit Points equal to the Hit Points of the first form into which it shape-shifts. These Temporary Hit Points vanish if any remain when the spell ends. The transformation lasts for the duration or until the target ends it as a Bonus Action."
            }
        ],
        "previous_spell": 13,
        "next_spell": 15,
        "special": []
    },
    {
        "id": 15,
        "name": "Animate Dead",
        "school": "Necromancy",
        "spell_lists": [
            "Cleric",
            "Wizard"
        ],
        "level": 3,
        "casting_time": "1 minute",
        "range": "10 feet",
        "components": [
            "V",
            "S",
            "M (a drop of blood, a piece of flesh, and a pinch of bone dust)"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Choose a pile of bones or a corpse of a Medium or Small Humanoid within range. The target becomes an Undead creature: a Skeleton if you chose bones or a Zombie if you chose a corpse (see appendix B for the stat blocks)."
            },
            {
                "type": "body",
                "text": "On each of your turns, you can take a Bonus Action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move on its next turn, or you can issue a general command, such as to guard a chamber or corridor. If you issue no commands, the creature takes the Dodge action and moves only to avoid harm. Once given an order, the creature continues to follow it until its task is complete."
            },
            {
                "type": "body",
                "text": "The creature is under your control for 24 hours, after which it stops obeying any command you’ve given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell rather than animating a new creature."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "You animate or reassert control over two additional Undead creatures for each spell slot level above 3. Each of the creatures must come from a different corpse or pile of bones."
            }
        ],
        "previous_spell": 14,
        "next_spell": 16,
        "special": []
    },
    {
        "id": 16,
        "name": "Animate Objects",
        "school": "Transmutation",
        "spell_lists": [
            "Bard",
            "Sorcerer",
            "Wizard"
        ],
        "level": 5,
        "casting_time": "Action",
        "range": "120 feet",
        "components": [
            "V",
            "S"
        ],
        "duration": "Concentration, up to 1 minute",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "Objects animate at your command. Choose a number of nonmagical objects within range that aren’t being worn or carried, aren’t fixed to a surface, and aren’t Gargantuan. The maximum number of objects is equal to your spellcasting ability modifier; for this number, a Medium or smaller target counts as one object, a Large target counts as two, and a Huge target counts as three."
            },
            {
                "type": "body",
                "text": "Each target animates, sprouts legs, and becomes a Construct that uses the Animated Object stat block; this creature is under your control until the spell ends or until it is reduced to 0 Hit Points. Each creature you make with this spell is an ally to you and your allies. In combat, it shares your Initiative count and takes its turn immediately after yours."
            },
            {
                "type": "body",
                "text": "Until the spell ends, you can take a Bonus Action to mentally command any creature you made with this spell if the creature is within 500 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to each one). If you issue no commands, the creature takes the Dodge action and moves only to avoid harm. When the creature drops to 0 Hit Points, it reverts to its object form, and any remaining damage carries over to that form."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "The creature’s Slam damage increases by 1d4 (Medium or smaller), 1d6 (Large), or 1d12 (Huge) for each spell slot level above 5."
            }
        ],
        "previous_spell": 15,
        "next_spell": 17,
        "special": []
    },
    {
        "id": 17,
        "name": "Acid Arrow",
        "school": "Evocation",
        "spell_lists": [
            "Wizard"
        ],
        "level": 2,
        "casting_time": "Action",
        "range": "90 feet",
        "components": [
            "V",
            "S",
            "M (powdered rhubarb leaf)"
        ],
        "duration": "Instantaneous",
        "description": [
            {
                "type": "body",
                "first": true,
                "text": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes 4d4 Acid damage and 2d4 Acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage only."
            },
            {
                "type": "body",
                "label": "Using a Higher-Level Spell Slot",
                "text": "The damage (both initial and later) increases by 1d4 for each spell slot level above 2."
            }
        ],
        "previous_spell": 0,
        "next_spell": 1,
        "special": []
    }
]